app/Views/layout/v_head.php

SELECT *
FROM `tbl_setting`
WHERE `id` = 1
---
<head>
    <?php
    $db = \Config\Database::connect();
    $web = $db->table('tbl_setting')->where('id', 1)->get()->getRowArray();