app/Controllers/Home.php

    public function SettingUser()
    {
        $session = session();
        $id_user = $session->get('id_user'); // Pastikan session ada id_user
        $model = new \App\Models\ModelUser();
        $user = $model->find($id_user);
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id_user` = '1'

    public function SettingUserSave()
    {
        $session = session();
        $id_user = $session->get('id_user');

        $model = new \App\Models\ModelUser();
        $user = $model->find($id_user);

        if (!$user) {
            return redirect()->to('/')->with('error', 'User tidak ditemukan.');
        }

        $nama_user = $this->request->getPost('nama_user');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $data = [
            'nama_user' => $nama_user,
            'email' => $email
        ];

        if (!empty($password)) {
            $data['password'] = sha1($password); // Hash password jika diisi
        }

        $model->update($id_user, $data);
---
SELECT *
FROM `tbl_user`
WHERE `tbl_user`.`id_user` = '1'
UPDATE `tbl_user` SET `nama_user` = 'Admin', `email` = 'admin@gmail.com', `password` = '7c222fb2927d828af22f592134e8932480637c0d'
WHERE `tbl_user`.`id_user` IN ('1')