app/Controllers/Store.php

SELECT *
FROM `tbl_warna`
WHERE `id_warna` IN ('1','2')
---
    public function cart()
    {
        $cart = \Config\Services::cart();
        $isi_cart = $cart->contents();

        // Ambil semua ID warna unik dari cart
        $id_warnas = array_unique(array_column(array_map(function($item) {
            return ['id_warna' => $item['options']['warna']];
        }, $isi_cart), 'id_warna'));

        // Ambil data nama warna dari DB
        $warnaMap = [];
        if (!empty($id_warnas)) {
            $warnaData = $this->ModelWarna->whereIn('id_warna', $id_warnas)->findAll();

SELECT *
FROM `tbl_warna`
WHERE `id_warna` IN ('1','2')
---
            // Ambil data warna dari DB
            $warnaMap = [];
            if (!empty($id_warnas)) {
                $warnaData = $this->ModelWarna->whereIn('id_warna', $id_warnas)->findAll();