app/Models/ModelPenjualan.php

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `kode_produk` = '11118'
---
    public function CekProduk($kode_produk)
    {
        return $this->db->table('tbl_produk')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
            ->where('kode_produk', $kode_produk)
            ->get()
            ->getRowArray();

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `stok` >0
---
    public function AllProduk()
    {
        return $this->db->table('tbl_produk')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
            ->where('stok > 0')
            ->get()
            ->getResultArray();

INSERT INTO `tbl_jual` (`no_faktur`, `tgl_jual`, `jam`, `grand_total`, `dibayar`, `kembalian`, `id_user`) VALUES ('250527289002', '2025-05-27', '06:25:55', 96000, '100000', '4000', '1')
---
    public function InsertJual($data)
    {
        $this->db->table('tbl_jual')->insert($data);

INSERT INTO `tbl_rinci_jual` (`no_faktur`, `kode_produk`, `harga`, `modal`, `qty`, `total_harga`, `untung`) VALUES ('250527289002', '11116', 30000, '24000', 3, 90000, 18000)
---
    public function InsertRinciJual($data)
    {
        $this->db->table('tbl_rinci_jual')->insert($data);