app/Models/ModelAdmin.php

SELECT *
FROM `tbl_setting`
WHERE `id` = '1'
---
    public function DetailData()
    {
        return $this->db->table('tbl_setting')
            ->where('id', '1')
            ->get()
            ->getRowArray();

SELECT `tbl_jual`.`tgl_jual`, SUM(`tbl_rinci_jual`.`total_harga`) AS `total_harga`, SUM(`tbl_rinci_jual`.`untung`) AS `untung`
FROM `tbl_rinci_jual`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur`=`tbl_rinci_jual`.`no_faktur`
WHERE month(tbl_jual.tgl_jual) = '05'
AND year(tbl_jual.tgl_jual) = '2025'
GROUP BY `tbl_jual`.`tgl_jual`
---
    public function Grafik()
    {
        return $this->db->table('tbl_rinci_jual')
        ->join('tbl_jual', 'tbl_jual.no_faktur=tbl_rinci_jual.no_faktur')
        ->where('month(tbl_jual.tgl_jual)', date('m'))
        ->where('year(tbl_jual.tgl_jual)', date('Y'))
        ->select('tbl_jual.tgl_jual')
        ->groupBy('tbl_jual.tgl_jual')
        ->selectSum('tbl_rinci_jual.total_harga')
        ->selectSum('tbl_rinci_jual.untung')
        ->get()->getResultArray();

SELECT COUNT(*) AS `numrows` FROM `tbl_produk`
---
    public function JumlahProduk()
    {
        return $this->db->table('tbl_produk')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_kategori`
---
    public function JumlahKategori()
    {
        return $this->db->table('tbl_kategori')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_satuan`
---
    public function JumlahSatuan()
    {
        return $this->db->table('tbl_satuan')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_user`
---
    public function JumlahUser()
    {
        return $this->db->table('tbl_user')->countAll();