app/Models/ModelWarna.php

    public function AllData()
    {
        return $this->db->table('tbl_warna')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_warna`

    public function InsertData($data)
    {
        $this->db->table('tbl_warna')->insert($data);
---
INSERT INTO `tbl_warna` (`nama_warna`) VALUES ('Hijau')