app/Models/ModelTransaksiPesanan.php

    public function AllData()
    {
        return $this->db->table('tbl_transaksi')
            ->orderBy('id_transaksi', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_transaksi`
ORDER BY `id_transaksi` DESC

    public function AllDataTransaksi($id_user)
    {
        return $this->db->table('tbl_transaksi')
            ->where('id_user', $id_user)
            ->orderBy('id_transaksi', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_transaksi`
WHERE `id_user` = '5'
ORDER BY `id_transaksi` DESC

    public function getDetail($id_transaksi)
    {
        return $this->db->table('tbl_transaksi')
            ->where('id_transaksi', $id_transaksi)
            ->get()
            ->getRowArray(); // Mengambil 1 data dalam bentuk array
---
SELECT *
FROM `tbl_transaksi`
WHERE `id_transaksi` = '13'

    public function getProdukByStatus($status)
    {
        return $this->db->table('tbl_transaksi')
            ->where('tbl_transaksi.status_transaksi', $status)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_transaksi`
WHERE `tbl_transaksi`.`status_transaksi` = '2'

    public function StatusKonfirmasi()
    {
        return $this->db->table('tbl_transaksi')
            ->where('status_transaksi', 0)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_transaksi`
WHERE `status_transaksi` = 0

    public function StatusProses()
    {
        return $this->db->table('tbl_transaksi')
            ->where('status_transaksi', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_transaksi`
WHERE `status_transaksi` = 1

    public function StatusSelesai()
    {
        return $this->db->table('tbl_transaksi')
            ->where('status_transaksi', 2)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_transaksi`
WHERE `status_transaksi` = 2