app/Models/ModelStore.php

    public function AllData_Kategori()
    {
        return $this->db->table('tbl_kategori')
            ->orderBy('id_kategori', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_kategori`
ORDER BY `id_kategori` DESC

    public function Detail_Produk($id_produk)
    {
        return $this->db->table('tbl_produk')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
            ->where('id_produk', $id_produk)
            ->get()
            ->getRow();
---
SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `id_produk` = '9'

    public function gambar_barang($id_produk)
    {
        return $this->db->table('tbl_gambar_produk')
            ->where('id_produk', $id_produk)
            ->get()
            ->getResult();
---
SELECT *
FROM `tbl_gambar_produk`
WHERE `id_produk` = '9'

    public function warna_produk($id_produk)
    {
        return $this->db->table('tbl_produk_warna')
            ->join('tbl_warna', 'tbl_warna.id_warna=tbl_produk_warna.id_warna')
            ->where('id_produk', $id_produk)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_produk_warna`
JOIN `tbl_warna` ON `tbl_warna`.`id_warna`=`tbl_produk_warna`.`id_warna`
WHERE `id_produk` = '9'