app/Models/ModelRinciTransaksi.php

SELECT *
FROM `tbl_rinci_transaksi`
JOIN `tbl_produk` ON `tbl_produk`.`id_produk`=`tbl_rinci_transaksi`.`id_produk`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `no_order` = '202410023HINLPZ0'
---
    public function getRinciByOrder($no_order)
    {
        return $this->db->table('tbl_rinci_transaksi')
            ->join('tbl_produk', 'tbl_produk.id_produk=tbl_rinci_transaksi.id_produk')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
            ->where('no_order', $no_order)
            ->get()
            ->getResultArray();