app/Models/ModelProduk.php

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
ORDER BY `id_produk` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_produk')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
            ->orderBy('id_produk', 'DESC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `tbl_produk`
WHERE `status` = 1
---
    public function JumlahStatusTersedia()
    {
        return $this->db->table('tbl_produk')
            ->where('status', 1)
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_produk`
WHERE `status` = 2
---
    public function JumlahStatusRendah()
    {
        return $this->db->table('tbl_produk')
            ->where('status', 2)
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_produk`
WHERE `status` = 3
---
    public function JumlahStatusHabis()
    {
        return $this->db->table('tbl_produk')
            ->where('status', 3)
            ->countAllResults();

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan` = `tbl_produk`.`id_satuan`
WHERE `tbl_produk`.`status` = '2'
---
    public function getProdukByStatus($status)
    {
        return $this->db->table('tbl_produk')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_produk.id_kategori')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan = tbl_produk.id_satuan')
            ->where('tbl_produk.status', $status)
            ->get()
            ->getResultArray();

SELECT `tbl_produk`.*, AVG(tbl_rating.rating) as rata_rating
FROM `tbl_produk`
JOIN `tbl_rating` ON `tbl_rating`.`id_produk` = `tbl_produk`.`id_produk`
GROUP BY `tbl_produk`.`id_produk`
HAVING `rata_rating` >= 3
ORDER BY RAND()
 LIMIT 3
---
    public function getRekomendasiProduk()
    {
        return $this->db->table('tbl_produk')
            ->select('tbl_produk.*, AVG(tbl_rating.rating) as rata_rating')
            ->join('tbl_rating', 'tbl_rating.id_produk = tbl_produk.id_produk')
            ->groupBy('tbl_produk.id_produk')
            ->having('rata_rating >=', 3) // Filter misal minimal 3, atau sesuaikan
            ->orderBy('RAND()') // Acak urutan data
            ->limit(3)
            ->get()
            ->getResultArray();