app/Models/ModelRekening.php

SELECT *
FROM `tbl_rekening`
---
    public function AllData()
    {
        return $this->db->table('tbl_rekening')
            ->get()
            ->getResultArray();

UPDATE `tbl_rekening` SET `id_rekening` = '2', `nama_rekening` = 'BNU', `atas_nama` = 'coba test', `no_rekening` = '000001'
WHERE `id_rekening` = '2'
---
    public function UpdateData($data)
    {
        $this->db->table('tbl_rekening')
            ->where('id_rekening', $data['id_rekening'])
            ->update($data);