app/Models/ModelLaporan.php

SELECT `tbl_barangmasuk`.*, `tbl_produk`.`nama_produk`, `tbl_produk`.`id_kategori`, `tbl_produk`.`kode_produk`, `tbl_satuan`.`nama_satuan`
FROM `tbl_barangmasuk`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_barangmasuk`.`kode_produk`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan` = `tbl_barangmasuk`.`id_satuan`
WHERE `tbl_produk`.`id_kategori` = 1
AND DATE(tbl_barangmasuk.tanggal) = '2025-05-30'
---
    public function DataStokMasukProduk($tgl)
    {
        return $this->db->table('tbl_barangmasuk')
            ->select('tbl_barangmasuk.*, tbl_produk.nama_produk, tbl_produk.id_kategori, tbl_produk.kode_produk, tbl_satuan.nama_satuan')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_barangmasuk.kode_produk')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan = tbl_barangmasuk.id_satuan')
            ->where('tbl_produk.id_kategori', 1)
            ->where('DATE(tbl_barangmasuk.tanggal)', $tgl)
            ->get()
            ->getResultArray();

SELECT `tbl_barangkeluar`.*, `tbl_produk`.`nama_produk`, `tbl_produk`.`id_kategori`, `tbl_produk`.`kode_produk`, `tbl_satuan`.`nama_satuan`
FROM `tbl_barangkeluar`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_barangkeluar`.`kode_produk`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan` = `tbl_barangkeluar`.`id_satuan`
WHERE `tbl_produk`.`id_kategori` = 2
AND DATE(tbl_barangkeluar.tanggal) = '2025-05-30'
---
    public function DataStokKeluarBahanBaku($tgl)
    {
        return $this->db->table('tbl_barangkeluar')
            ->select('tbl_barangkeluar.*, tbl_produk.nama_produk, tbl_produk.id_kategori, tbl_produk.kode_produk, tbl_satuan.nama_satuan')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_barangkeluar.kode_produk')
            ->join('tbl_satuan', 'tbl_satuan.id_satuan = tbl_barangkeluar.id_satuan')
            ->where('tbl_produk.id_kategori', 2)
            ->where('DATE(tbl_barangkeluar.tanggal)', $tgl)
            ->get()
            ->getResultArray();